{
  "modelTopology": {
    "class_name": "Sequential",
    "config": {
      "name": "boostai_prediction_model",
      "layers": [
        {
          "class_name": "Dense",
          "config": {
            "units": 16,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "input_shape": [6],
            "name": "dense_1"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 8,
            "activation": "relu",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "dense_2"
          }
        },
        {
          "class_name": "Dense",
          "config": {
            "units": 1,
            "activation": "sigmoid",
            "use_bias": true,
            "kernel_initializer": {
              "class_name": "GlorotUniform",
              "config": {"seed": null}
            },
            "bias_initializer": {
              "class_name": "Zeros",
              "config": {}
            },
            "name": "dense_3"
          }
        }
      ]
    }
  },
  "weightsManifest": [
    {
      "paths": ["boostai-weights.bin"],
      "weights": [
        {"name": "dense_1/kernel", "shape": [6, 16], "dtype": "float32"},
        {"name": "dense_1/bias", "shape": [16], "dtype": "float32"},
        {"name": "dense_2/kernel", "shape": [16, 8], "dtype": "float32"},
        {"name": "dense_2/bias", "shape": [8], "dtype": "float32"},
        {"name": "dense_3/kernel", "shape": [8, 1], "dtype": "float32"},
        {"name": "dense_3/bias", "shape": [1], "dtype": "float32"}
      ]
    }
  ],
  "format": "layers-model",
  "generatedBy": "BoostAI v2.0.0",
  "convertedBy": "StaticBoost Pro"
}